package pmd.app.service;

import java.util.HashMap;

public interface AppProtocolService {

	/*******************************************************************************************************
	 * 어플리케이션 - 회원가입																							*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appJoin(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 로그인																								*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appLogin(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 아이디/비밀번호 찾기																				*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appFindAccount(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 요약정보																							*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appGraph(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 사용자목록, 사용현황																				*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appStatus(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 정품/복제 소프트웨어 토글 버튼																	*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appToggleSoftware(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 보유 소프트웨어 목록 (미구매 제품 포함)														*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appProductList(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 보유 소프트웨어 등록 (주어진 목록에서)														*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appAddProduct(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 보유 소프트웨어 정보 수정																		*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appModProduct(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 보유 소프트웨어 정보 삭제																		*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appDelProduct(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 여러 소프트웨어 견적 요청 (key: estimate)														*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appEstimate(HashMap<String, Object> paramMap);

	/*******************************************************************************************************
	 * 어플리케이션 - 소프트웨어 검색																					*
	 * @param commandMap																								*
	 * @return																												*
	 * @throws Exception																									*
	 *******************************************************************************************************/
	String appSearch(HashMap<String, Object> paramMap);

}
