<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
개인정보의 수집 및 이용목적

PMD에서는 회원 여러분에게 다양한 서비스를 제공하기 위하여 몇 가지 방법을 통해 개인정보를 수집하고 있습니다.

① PMD 가입할 때 기입하는 정보에는 서비스 이용 상 꼭 필요한 필수 입력 사항과 보다 나은 서비스 제공을 위한 선택 입력 사항이 있습니다. PMD 일반회원(개인) 가입 시 필수 입력 사항은 이름, 아이디, 비밀번호, E-Mail이며, 그 외의 입력 사항은 모두 선택 사항입니다. 알툴즈 닷컴 기업회원(회사/단체회원) 가입 시엔 법 인명(단체명), 사업자 등록번호, 비밀번호, 대표 E-mail, 업태, 종목, 담당자 정보입력(이름, 이메일) 이며 모두 필수 입력사항입니다. 이와 별도로 PMD에서 특별한 서비스의 제공을 위해 추가 정보를 입력해야 하는 경우와 유료 콘텐츠를 이용할 때 대금 결제를 위한 정보를 입력해야 하는 경우가 있습니다.
②PMD에서 진행하는 각종 이벤트 및 설문 참여시 이벤트 효과 분석 및 이벤트 사후 관리 (당첨자 확인 및 상품 발송) 또는 설문 결과에 대한 통계 분석 등을 위해 필요한 정보를 제공 받거나 직접 묻게 되는 경우가 있습니다.
③ PMD에서는 보다 나은 고객지원을 위해 필요한 정보를 제공받거나 직접 묻게 되는 경우가 있습니다.
④ PMD에서 쿠키(cookie)를 통하여 이용자 여러분의 정보를 얻는 경우가 있습니다.


2. 수집하는 개인정보의 항목

회원 여러분에게 다양한 서비스를 제공하기 위하여 몇 가지 방법을 통해 개인정보를 수집하고 있습니다. 
[수집항목]
① 가입 시 필수 입력 사항은 이름, 아이디, 비밀번호, E-Mail 등 입니다.
② 그외 선택 입력 사항이 있습니다. 
③ 특별한 서비스의 제공을 위해 추가 정보를 입력해야 하는 경우와 유료 컨텐트를 이용할 때 대금 결제를 위한 정보를 입력해야 하는 경우가 있습니다.


3. 개인정보의 보유 및 이용 기간

회원이 PMD 가입 시 제공한 정보는 회원 가입 시점부터 해지 완료 후 30일까지 보관할 수 있습니다. 단 유료서비스를 구매하거나 전 자상거래를 이용한 회원의 개인정보와 거래 내역은 만약에 있을 수 있는 반품, 환불, 신용카드 매출취소 등이 경우를 대비하여 90일간 보관됩니다. 상법 등 관련 법령의 규정에 의하여 보존할 필요성이 있는 경우에는 다음 내용과 같이 보존합니다.

보존 항목 : 계약 또는 청약철회 등에 관한 기록
보존 근거 : 전자상거래등에서의 소비자보호에 관한 법률
보존 기간 : 5년

보존 항목 : 대금결제 및 재화 등의 공급에 관한 기록
보존 근거 : 전자상거래등에서의 소비자보호에 관한 법률
보존 기간 : 5년

보존 항목 : 소비자의 불만 또는 분쟁처리에 관한 기록
보존 근거 : 전자상거래등에서의 소비자보호에 관한 법률
보존 기간 : 3년

회사는 개인정보의 수집 및 이용목적이 달성되면 아래의 방법으로 파기 및 분리보관 됩니다.
[개인정보 파기 절차]
① 고객님이 입력한 개인정보는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 일정 기간 저장 후 파기됩니다.
[개인정보 파기 방법]
① 종이에 출력된 개인정보는 분쇄기로 분쇄하여 파기합니다.
② 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
[휴면계정 분리보관]
① 1년이상 서비스 미이용자의 개인정보보호를 위하여 2015년 8월 18일부로 다른 고객의 개인정보와 분리, 보관하여 서비스 이용을 제한합니다.
② 휴면계정 전환 이후 고객은 별도의 인증절차를 통해 휴면을 해제할 수 있습니다.

